-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Sep 29, 2023 at 09:34 AM
-- Server version: 5.7.15-log
-- PHP Version: 5.6.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `domshop`
--
CREATE DATABASE IF NOT EXISTS `domshop` DEFAULT CHARACTER SET tis620 COLLATE tis620_thai_ci;
USE `domshop`;

-- --------------------------------------------------------

--
-- Table structure for table `category`
--

CREATE TABLE `category` (
  `c_id` int(4) NOT NULL,
  `c_name` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=tis620;

--
-- Dumping data for table `category`
--

INSERT INTO `category` (`c_id`, `c_name`) VALUES
(1, 'พระเหรียญ'),
(2, 'พระผง'),
(3, 'พระกรุ'),
(4, 'พระเนื้อโลหะ'),
(5, 'พระเนื้อเงิน');

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `p_id` int(7) NOT NULL,
  `p_name` varchar(200) NOT NULL,
  `p_detail` text NOT NULL,
  `p_price` bigint(10) NOT NULL,
  `p_img` varchar(200) NOT NULL,
  `p_type` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=tis620;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`p_id`, `p_name`, `p_detail`, `p_price`, `p_img`, `p_type`) VALUES
(1, 'หลวงปู่ศุข ', 'ผู้สร้าง พระครูวิมลคุณากร หรือ หลวงปู่ศุข วัดปากคลองมะขามเฒ่า', 1500000, 'jpg', 1),
(2, 'หลวงปู่รอด ', ' หลวงปู่รอด อาภสุสโร หรือ พระครูอาภัสร์ธรรมคุณ\r\nวัดโคกรม', 350000, 'jpg', 1),
(3, 'หลวงพ่อสุด \r\n', 'พระครูสมุทรธรรมสุนทร (สุด สิริธโร) หรือหลวงพ่อสุด\r\nวัดกาหลง ', 450000, 'jpg', 1),
(4, 'หลวงพ่อกาหลงเขี้ยวแก้ว ', 'หลวงปู่กาหลง เตชวัณโณ หรือที่รู้จักกันดีในนามหลวงปู่กาหลง เขี้ยวแก้ว พระเถราจารย์หนึ่งเดียวที่มีเขี้ยวแก้วกลางเพดานปาก วัดเขาแหลม ', 200000, 'jpg', 1),
(5, 'หลวงปู่ทวด', 'สมเด็จพระราชมุนีสามีรามคุณูปมาจารย์ (สมเด็จเจ้าพะโคะ,หลวงปู่ทวดเหยียบน้ำทะเลจืด หลวงปู่ทวดวัดช้างให้ ,ท่านองค์ดำ,ท่านลังกา) วัดช้างให้ ', 1700000, 'jpg', 4),
(6, 'หลวงปู่ไข่', ' อินทสโร ภิกขุ หรือ หลวงปู่ไข่ อินทสโร วัดบพิตรพิมุขวรวิหาร (เชิงเลน)วัดเชิงเลน ', 750000, 'jpg', 1),
(7, 'หลวงปู่สรวง ', 'หลวงปู่สรวง บายตึ๊กเจีย , หลวงปู่สรวง เทวดาเดินดิน หรือดาบสซวง วัดไพรพัฒนา ', 650000, 'jpg', 1),
(8, 'หลวงปู่โต๊ะ', 'พระราชสังวราภิมณฑ์ หรือ หลวงปู่โต๊ะ วัดประดู่ฉิมพลี ', 3500000, 'jpg', 4),
(9, 'หลวงปู่หมุน', 'หลวงปู่หมุน ฐิตสีโล เป็นอีกหนึ่งครูบาอาจารย์ ที่มีการพูดถึงในเรื่องความศักดิ์สิทธิ์ วัดบ้านจาน ', 300000, 'jpg', 1),
(10, 'หลวงพ่อคูณ', 'พระเทพวิทยาคม นามเดิม คูณ ฉัตร์พลกรัง หรือที่รู้จักในนาม หลวงพ่อคูณ เป็นพระเกจิอาจารย์ อดีตที่ปรึกษาเจ้าคณะภาค 11 และอดีตเจ้าอาวาส วัดบ้านไร่', 1450000, 'jpg', 1),
(11, 'หลวงปู่กลั่น ', 'หลวงพ่อกลั่น ธมฺมโชติ  วัดพระญาติการาม', 690000, 'jpg', 1),
(12, 'พระผงของขวัญ ', 'ในสมัยที่พระเดชพระคุณหลวงปู่วัดปากน้ำ ภาษีเจริญ พระมงคลเทพมุนี (สด จนฺทสโร) ยังมีชีวิตอยู่ ท่านได้ผลิต ?พระผงวัดปากน้ำ? หรือที่เรียกกันว่า ?พระของขวัญ? ออกมา 3 รุ่น รุ่นละ 84,000 องค์ ซึ่งร่วมทั้ง 3 รุ่นก็มีจำนวนมากถึง 252,000 องค์ เนื่องจากพระของขวัญของหลวงปู่มีความศักดิ์สิทธิ์มาก มีชื่อเสียงเลื่องลือไปทั่ว จึงมีผู้คนจำนวนมากทั้งในประเทศและต่างประเทศ เดินทางข้ามน้ำข้ามทะเล ไปรับพระของขวัญของหลวงปู่ที่วัดปากน้ำด้วยตนเอง', 800000, 'jpg', 2),
(13, 'หลวงปู่คง ', 'พระอุปฌาย์คง ธมฺมโชโต หรือ หลวงพ่อคง ธมฺมโชโต\r\nวัดบางกระพ้อม ', 10000000, 'jpg', 1),
(14, 'หลวงปู่มั่น ', 'หลวงปู่มั่น ภูริทตฺโต  เป็นพระเถระฝ่ายธรรมยุติกนิกาย ชาวจังหวัดอุบลราชธานี ผู้เป็นบูรพาจารย์สายพระป่าในประเทศไทย วัดป่าสุทธาวาส ', 950000, 'jpg', 1),
(15, 'หลวงปู่แหวน ', 'หลวงปู่แหวน สุจิณโณ เป็นภิกษุชาวไทย ฝ่ายธรรมยุติกนิกาย จำพรรษา ณ วัดดอยแม่ปั๋ง จังหวัดเชียงใหม่ ', 460000, 'jpg', 1),
(16, 'หลวงปู่แสง ', 'หลวงปู่แสง ญาณวโร พระเกจิชื่อดังแห่งดินแดนอีสาน วัดป่าดงสว่างธรรม ', 30000, 'jpg', 1),
(17, 'หลวงปู่ดู่ ', 'หลวงปู่ดู่ พรหมปัญโญ แห่งวัดสะแก จังหวัดพระนครศรีอยุธยา', 50000, 'jpg', 1),
(18, 'หลวงพ่อปาน ', 'หลวงพ่อปาน  กรุวัดคู้สลอด หนุมาน ลงกรุ สวยๆ ลึกมากๆวัดคู้สลอด ', 80000, 'jpg', 3),
(19, 'พระมเหศวรเดี่ยวเนื้อชินเงิน', 'พระมเหศวร กรุวัดพระศรีรัตนมหาธาตุ เป็นพระที่สร้างด้วย เนื้อชินเงิน มีเอกลักษณ์ที่ไม่เหมือนกับพระพิมพ์อื่นใด ไม่ว่าจะเป็นพระกรุไหนก็ตาม คือ พระพิมพ์นี้มี ๒ หน้า โดยพระเศียรของพระด้านหนึ่ง หากพลิกไปด้านหลังจะตรงกับฐานขององค์พระ คือ พระเศียรวางในตำแหน่งสวนกัน จึงเรียกชื่อพระพิมพ์นี้ว่า พระมเหศวร ทั้ง ๒ หน้าเป็นพระปางสะดุ้งมาร สร้างขึ้นในสมัยอู่ทอง', 45000, 'jpg', 5),
(20, 'หลวงพ่อสด ', 'พระผงของขวัญ วัดปากน้ำรุ่นแรก วัดปากน้ำ \r\n', 260000, 'jpg', 2);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`c_id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`p_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `category`
--
ALTER TABLE `category`
  MODIFY `c_id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `p_id` int(7) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
